app/views/devise/registrations/new.html.erb

SELECT "user_types".* FROM "user_types"
---
    <%= f.label :user_type %>
    <%= f.select :user_type_id, options_for_select(UserType.all.collect { |c| [c.name, c.id] }), { prompt: 'Select type' }, class: ' login-intxt form-control' %>