app/views/users/listing.html.erb

SELECT "users".* FROM "users" WHERE (user_type_id = (3) AND id NOT IN (NULL))
---

  <% if [1, 3].include? current_user.user_type_id %>