app/controllers/users_controller.rb

SELECT  "user_types".* FROM "user_types" WHERE "user_types"."id" = $1 ORDER BY "user_types"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "request_accesses".* FROM "request_accesses" WHERE "request_accesses"."requestor_id" = $1  [["requestor_id", 3]]
SELECT "request_accesses"."grantor_id" FROM "request_accesses" WHERE "request_accesses"."requestor_id" = $1  [["requestor_id", 3]]
SELECT "request_accesses".* FROM "request_accesses" WHERE "request_accesses"."grantor_id" = $1 AND "request_accesses"."status" = $2  [["grantor_id", 4], ["status", "pending"]]
---
  def listing
  	if user_signed_in?
      role = UserType.where(:id => current_user.user_type_id).first.name
      if role == "Doctor" || role == "Pharmacist"
      @access_requested_patients = RequestAccess.where(requestor_id: current_user.id)

      if @access_requested_patients.blank?
      @access_not_requested_patients = User.where('user_type_id = (?)',2)
      else
      @access_not_requested_patients = User.where('user_type_id = (?) AND id NOT IN (?)', 2, @access_requested_patients.pluck(:grantor_id))
      end

    elsif role == "Patient"
      @requestors = RequestAccess.where(grantor_id: current_user.id, :status => "pending")

INSERT INTO "request_accesses" ("created_at", "updated_at", "requestor_id", "grantor_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", 2018-07-21 07:48:19 UTC], ["updated_at", 2018-07-21 07:48:19 UTC], ["requestor_id", 3], ["grantor_id", 3]]
---
  def create_request
    request_access = RequestAccess.create(requestor_id: params[:user_id], grantor_id: params[:patient_id])

SELECT  "request_accesses".* FROM "request_accesses" WHERE "request_accesses"."grantor_id" = $1 AND "request_accesses"."requestor_id" = $2 ORDER BY "request_accesses"."id" ASC LIMIT $3  [["grantor_id", 4], ["requestor_id", 5], ["LIMIT", 1]]
UPDATE "request_accesses" SET "status" = $1, "updated_at" = $2 WHERE "request_accesses"."id" = $3  [["status", "approved"], ["updated_at", 2018-07-21 08:16:13 UTC], ["id", 2]]
---
  def approve_request
    request_access = RequestAccess.where(grantor_id: params[:user_id], requestor_id: params[:requestor_id]).first
    request_access.status = "approved"
    request_access.save!

SELECT  "request_accesses".* FROM "request_accesses" WHERE "request_accesses"."grantor_id" = $1 AND "request_accesses"."requestor_id" = $2 ORDER BY "request_accesses"."id" ASC LIMIT $3  [["grantor_id", 8], ["requestor_id", 9], ["LIMIT", 1]]
UPDATE "request_accesses" SET "status" = $1, "updated_at" = $2 WHERE "request_accesses"."id" = $3  [["status", "denied"], ["updated_at", 2018-07-21 10:50:06 UTC], ["id", 4]]
---
  def deny_request
    request_access = RequestAccess.where(grantor_id: params[:user_id], requestor_id: params[:requestor_id]).first
    request_access.status = "denied"
    request_access.save!

SELECT  "user_types".* FROM "user_types" WHERE "user_types"."id" = $1 ORDER BY "user_types"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "documents".* FROM "documents" WHERE "documents"."user_id" = $1 AND "documents"."type" = $2  [["user_id", 4], ["type", "prescription"]]
---
  def view_document
    role = UserType.where(:id => current_user.user_type_id).first.name
    @documents = User.where(id: params[:patient_id]).first.documents